package kumagai.Fukkatsu2.logic;

import java.util.*;

/**
 * 他のメンバーの名前確定用の名前→コード変換テーブル。
 *
 * あ：10 い：11 う：12 ･･･ ろ：52 わ：53 を：54 ん：55
 * っ：56 ゃ：57 ゅ：58 ょ：59 ゛：108 ゜：109 空白：95
 */
public class ローレシアの王子の名前テーブル
	extends HashMap<Character, Integer>
{
	/**
	 * 要素を追加しテーブルを構築する。
	 */
	public ローレシアの王子の名前テーブル()
	{
		put('あ', 10);
		put('い', 11);
		put('う', 12);
		put('え', 13);
		put('お', 14);
		put('か', 15);
		put('き', 16);
		put('く', 17);
		put('け', 18);
		put('こ', 19);
		put('さ', 20);
		put('し', 21);
		put('す', 22);
		put('せ', 23);
		put('そ', 24);
		put('た', 25);
		put('ち', 26);
		put('つ', 27);
		put('て', 28);
		put('と', 29);
		put('な', 30);
		put('に', 31);
		put('ぬ', 32);
		put('ね', 33);
		put('の', 34);
		put('は', 35);
		put('ひ', 36);
		put('ふ', 37);
		put('へ', 38);
		put('ほ', 39);
		put('ま', 40);
		put('み', 41);
		put('む', 42);
		put('め', 43);
		put('も', 44);
		put('や', 45);
		put('ゆ', 46);
		put('よ', 47);
		put('ら', 48);
		put('り', 49);
		put('る', 50);
		put('れ', 51);
		put('ろ', 52);
		put('わ', 53);
		put('を', 54);
		put('ん', 55);
		put('っ', 56);
		put('ゃ', 57);
		put('ゅ', 58);
		put('ょ', 59);
		put('゛', 108);
		put('゜', 109);
		put('　', 95);
	}
}
