package kumagai.Fukkatsu2.logic;

/**
 * ローレシアの王子の経験値一覧。
 */
public class ローレシアの王子の経験値
	extends ExperienceTable
{
	/**
	 * 経験値テーブル。
	 */
	static final public int [] table_ =
		new int []
		{
			0,
			12,
			32,
			72,
			140,
			280,
			560,
			1000,
			1800,
			2800,
			3900,
			5300,
			7600,
			10000,
			13000,
			17000,
			21000,
			26000,
			32000,
			40000,
			50000,
			61000,
			75000,
			90000,
			107000,
			127000,
			150000,
			175000,
			200000,
			230000,
			260000,
			290000,
			320000,
			350000,
			380000,
			410000,
			440000,
			470000,
			500000,
			530000,
			570000,
			620000,
			670000,
			720000,
			770000,
			820000,
			870000,
			920000,
			970000,
			1000000
		};

	/**
	 * 基底クラスを初期化し経験値テーブル情報を構築。
	 */
	public ローレシアの王子の経験値()
	{
		super(table_);
	}
}
